app/Controllers/AkunKaryawan.php

DELETE FROM `karyawan`
WHERE `nik` IN ('123456')
---
    public function delete($nik)
    {
        $karyawanModel = new Karyawan();
        $karyawanModel->delete($nik);

SELECT *
FROM `member`
WHERE `member`.`nik` = '18100104020204'
---
    public function cetakkartu($nik){
        $memberModel = new Member();
        $member = $memberModel->find($nik);