app/Controllers/DashboardKaryawan.php

SELECT COUNT(*) AS `numrows`
FROM `member`
SELECT *
FROM `member`
---
    public function index()
    {

        $curentPage = $this->request->getVar('page_member') ?  $this->request->getVar('page_member') : 1;
        $memberModel = new Member();
        $data['member'] = $memberModel->paginate(4, 'member');