app/Controllers/DashboardKaryawan.php

    public function delete($nik)
    {
        $memberModel = new Member();
        $memberModel->delete($nik);
---
DELETE FROM `member`
WHERE `nik` IN ('0987654321')