app/Controllers/DashboardAdmin.php

SELECT COUNT(*) AS `numrows`
FROM `member`
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
---
    public function index()
    {
        $memberModel = new Member();
        $karyawanModel = new Karyawan();

        $jumlah_Member =  $memberModel->countAllResults();
        $jumlah_Karyawan =  $karyawanModel->countAllResults();