app/Controllers/ListKaryawan.php

SELECT *
FROM `karyawan`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
SELECT *
FROM `karyawan`
 LIMIT 2
---
    public function index()
    {
        $curentPage = $this->request->getVar('page_karyawan')  ?  $this->request->getVar('page_karyawan') : 1;
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $karyawan = $this->karyawanModel->search($keyword);
        } else {
            $karyawan = $this->karyawanModel;
        }

        $karyawanModel = new Karyawan();
        $data['karyawan'] = $karyawan->paginate(2, 'karyawan');
        $data['karyawanModel'] = $karyawanModel->paginate(2, 'karyawanModel');