app/Controllers/LoginKaryawan.php

    public function process(){
        $karyawan = new Karyawan();
        $nik = $this->request->getVar('nik');
        $pin = $this->request->getVar('pin');
        $dataKaryawan = $karyawan->where([
            'nik' => $nik,
        ])->first();
---
SELECT *
FROM `karyawan`
WHERE `nik` = '1810010402020004'
 LIMIT 1