app/Controllers/Regis.php

    public function create()
    {
        $karyawanModel = new Karyawan();
        $karyawan = $karyawanModel->findAll();
---
SELECT *
FROM `karyawan`